{
  "experiences": [
    {
      "position": "System Developer",
      "company": "Avensia AB",
      "allocation": "100%",
      "type": "Permanent position",
      "duration": {
        "start": "2021-10",
        "end": "2024-04"
      },
      "location": {
        "city": "Helsingborg",
        "country": "Sweden"
      },
      "responsibilities": [
        "Development of e-commerce solutions on Nitro product (based on Optimizely CMS and Commerce)",
        "Work with integrations such as Klarna Checkout, Voyado Elevate indexing, inRiver PIM, Voyado CRM",
        "Primary focus on BE using .NET (.NET Framework in older projects and modern .NET in newer)",
        "Administrating CI/CD with TeamCity and Octopus",
        "Working extensively with MSSQL server"
      ],
      "achievements": [
        "Engaged in diverse client projects",
        "Maintained great collaboration with clients and colleagues",
        "Gained recognition as a technically competent developer",
        "Known for delivering high-quality results"
      ],
      "skills": [
        ".NET",
        "C#",
        "Azure",
        "Docker",
        "CI/CD",
        "MSSQL",
        "EPiServer",
        "Optimizely",
        "Teamcity",
        "Octopus",
        "React.js",
        "JavaScript",
        "Git",
        "Scrum"
      ]
    },
    {
      "position": "Backend Developer",
      "company": "Inyett AB",
      "allocation": "100%",
      "type": "Permanent position",
      "duration": {
        "start": "2019-02",
        "end": "2021-10"
      },
      "location": {
        "city": "Helsingborg",
        "country": "Sweden"
      },
      "responsibilities": [
        "Development on Inyet's SaaS solution for scanning and analyzing payments, to detect faults, frauds etc.",
        "Mostly work on the BE parts (.NET/SQL) and and some limited FE work (AngularJS)",
        "Introducing Scrum to the organization as the Scrum Master",
        "Setting up and maintaining CI/CD with TeamCity and Octopus",
        "Working extensively with MSSQL server, auditing execution plans, etc."
      ],
      "achievements": [
        "Successfully worked with all parts of the product with different stakeholders",
        "Participated in taking the solution from old-school .NET to modern cloud-based",
        "Esteemed as a valuable and competent colleague",
        "Known for delivering high-quality results"
      ],
      "skills": [
        ".NET",
        "C#",
        "Azure",
        "CI/CD",
        "MSSQL",
        "Teamcity",
        "Octopus",
        "React.js",
        "Angular",
        "JavaScript",
        "Git",
        "Scrum"
      ]
    }
  ],
  "certifications": [
    {
      "name": "Microsoft Certified: Azure Developer Associate",
      "issuingOrganization": "Microsoft",
      "issueDate": "2023-01",
      "url": "https://learn.microsoft.com/api/credentials/share/en-us/MaxWallin-0718/FEA71CB95B51EEE5",
      "skills": [".NET", "Microsoft Azure"]
    },
    {
      "name": "Professional Scrum Master I",
      "issuingOrganization": "Scrum.org",
      "issueDate": "2019-05",
      "url": "https://www.scrum.org/certificates/413818",
      "skills": ["Scrum", "Agile"]
    }
  ],
  "education": [
    {
      "name": "Business Administration with major in Finance",
      "description": "The Bachelor's degree in Finance at Lund University covers economics, business administration, statistics, and business law. The program includes group work and various examination formats. Students choose specializations such as Entrepreneurship, Financing, Leadership and Change Management, Marketing, or Business and Data Analytics. The final term includes a comprehensive program examination to review and apply the knowledge gained.",
      "degree": "Bachelor's degree",
      "school": "Lund University",
      "duration": {
        "start": "2008-01",
        "end": "2012-02"
      },
      "skills": ["Leadership", "Change Management", "Financial analysis", "Statistical Analysis"]
    },
    {
      "name": "Portuguese Letters",
      "description": "The Bachelor's degree in Portuguese Literature at Högskolan Dalarna provides training in the Portuguese language and its diverse literary traditions. The coursework includes studies on contemporary Brazilian and Portuguese literature, African literature in Portuguese, and their societal impacts. Students develop skills in phonetics, grammar, and both written and oral communication. The program covers theoretical aspects of language in society, linguistic variation, and explores transcultural perspectives in contemporary literature. It focuses on literary analysis, research methodologies, and scientific specialization, ending with a comprehensive thesis project.",
      "degree": "Bachelor's degree",
      "school": "Högskolan Dalarna",
      "duration": {
        "start": "2012-06",
        "end": "2017-01"
      },
      "skills": ["Linguistics", "Portuguese", "Brazilian Portuguese", "Comparative Literature", "Literary Theory"]
    },
    {
      "name": "Portuguese Letters",
      "description": "The program for iPhone and Android programmers covers comprehensive training in developing mobile applications using Swift and Java/Kotlin. It includes knowledge of publishing requirements for iOS and Android, understanding market demands, sales channels, and development tools. The curriculum covers programming, debugging, configuration of development tools, and documentation processes. Students learn about factors affecting programming quality, methods for internationalization, automation tools for IoT, and various programming languages and tools for IoT. The course emphasizes creating apps according to specifications, publishing them, and ensuring they meet quality standards\nSome months into the course I was accepted to CapGemini's trainee program, so I made my course internship as employee at CapGemini.",
      "degree": "Vocational Degree",
      "school": "Malmö Yrkeshögskola",
      "duration": {
        "start": "2012-06",
        "end": "2017-01"
      },
      "skills": ["Mobile Applications", "Swift", "Java", "Kotlin", "IoT"]
    }
  ]
}
